grevaillot/svd_tools/headers/STM32H7A3x/bdma1.h
#pragma once 

/* --- BDMA1: BDMA1 ------------------------------------------------- */

/** @defgroup bdma1_registers BDMA1 Register
@{*/

/** BDMA1_ISR DMA interrupt status register **/
#define BDMA1_ISR			MMIO32(BDMA1_BASE + 0x00)
/** BDMA1_IFCR DMA interrupt flag clear register **/
#define BDMA1_IFCR			MMIO32(BDMA1_BASE + 0x04)
/** BDMA1_CCR0 DMA channel x configuration register **/
#define BDMA1_CCR0			MMIO32(BDMA1_BASE + 0x08)
/** BDMA1_CNDTR0 DMA channel x number of data register **/
#define BDMA1_CNDTR0			MMIO32(BDMA1_BASE + 0x0c)
/** BDMA1_CPAR0 This register must not be written when the channel is enabled. **/
#define BDMA1_CPAR0			MMIO32(BDMA1_BASE + 0x10)
/** BDMA1_CM0AR0 This register must not be written when the channel is enabled. **/
#define BDMA1_CM0AR0			MMIO32(BDMA1_BASE + 0x14)
/** BDMA1_CM1AR0 This register must not be written when the channel is enabled **/
#define BDMA1_CM1AR0			MMIO32(BDMA1_BASE + 0x18)
/** BDMA1_CCR1 DMA channel x configuration register **/
#define BDMA1_CCR1			MMIO32(BDMA1_BASE + 0x1c)
/** BDMA1_CNDTR1 DMA channel x number of data register **/
#define BDMA1_CNDTR1			MMIO32(BDMA1_BASE + 0x20)
/** BDMA1_CPAR1 This register must not be written when the channel is enabled. **/
#define BDMA1_CPAR1			MMIO32(BDMA1_BASE + 0x24)
/** BDMA1_CM0AR1 This register must not be written when the channel is enabled. **/
#define BDMA1_CM0AR1			MMIO32(BDMA1_BASE + 0x28)
/** BDMA1_CM1AR1 BDMA_CMAR1 **/
#define BDMA1_CM1AR1			MMIO32(BDMA1_BASE + 0x2c)
/** BDMA1_CCR2 DMA channel x configuration register **/
#define BDMA1_CCR2			MMIO32(BDMA1_BASE + 0x30)
/** BDMA1_CNDTR2 DMA channel x number of data register **/
#define BDMA1_CNDTR2			MMIO32(BDMA1_BASE + 0x34)
/** BDMA1_CPAR2 This register must not be written when the channel is enabled. **/
#define BDMA1_CPAR2			MMIO32(BDMA1_BASE + 0x38)
/** BDMA1_CM0AR2 This register must not be written when the channel is enabled. **/
#define BDMA1_CM0AR2			MMIO32(BDMA1_BASE + 0x3c)
/** BDMA1_CM1AR2 BDMA_CM1AR2 **/
#define BDMA1_CM1AR2			MMIO32(BDMA1_BASE + 0x40)
/** BDMA1_CCR3 DMA channel x configuration register **/
#define BDMA1_CCR3			MMIO32(BDMA1_BASE + 0x44)
/** BDMA1_CNDTR3 DMA channel x number of data register **/
#define BDMA1_CNDTR3			MMIO32(BDMA1_BASE + 0x48)
/** BDMA1_CPAR3 This register must not be written when the channel is enabled. **/
#define BDMA1_CPAR3			MMIO32(BDMA1_BASE + 0x4c)
/** BDMA1_CM0AR3 This register must not be written when the channel is enabled. **/
#define BDMA1_CM0AR3			MMIO32(BDMA1_BASE + 0x50)
/** BDMA1_CM1AR3 BDMA_CMAR3 **/
#define BDMA1_CM1AR3			MMIO32(BDMA1_BASE + 0x54)
/** BDMA1_CCR4 DMA channel x configuration register **/
#define BDMA1_CCR4			MMIO32(BDMA1_BASE + 0x58)
/** BDMA1_CNDTR4 DMA channel x number of data register **/
#define BDMA1_CNDTR4			MMIO32(BDMA1_BASE + 0x5c)
/** BDMA1_CPAR4 This register must not be written when the channel is enabled. **/
#define BDMA1_CPAR4			MMIO32(BDMA1_BASE + 0x60)
/** BDMA1_CM0AR4 This register must not be written when the channel is enabled. **/
#define BDMA1_CM0AR4			MMIO32(BDMA1_BASE + 0x64)
/** BDMA1_CM1AR4 BDMA_CM1AR4 **/
#define BDMA1_CM1AR4			MMIO32(BDMA1_BASE + 0x68)
/** BDMA1_CCR5 DMA channel x configuration register **/
#define BDMA1_CCR5			MMIO32(BDMA1_BASE + 0x6c)
/** BDMA1_CNDTR5 DMA channel x number of data register **/
#define BDMA1_CNDTR5			MMIO32(BDMA1_BASE + 0x70)
/** BDMA1_CPAR5 This register must not be written when the channel is enabled. **/
#define BDMA1_CPAR5			MMIO32(BDMA1_BASE + 0x74)
/** BDMA1_CM0AR5 This register must not be written when the channel is enabled. **/
#define BDMA1_CM0AR5			MMIO32(BDMA1_BASE + 0x78)
/** BDMA1_CM1AR5 This register must not be written when the channel is enabled. **/
#define BDMA1_CM1AR5			MMIO32(BDMA1_BASE + 0x7c)
/** BDMA1_CCR6 DMA channel x configuration register **/
#define BDMA1_CCR6			MMIO32(BDMA1_BASE + 0x80)
/** BDMA1_CNDTR6 DMA channel x number of data register **/
#define BDMA1_CNDTR6			MMIO32(BDMA1_BASE + 0x84)
/** BDMA1_CPAR6 This register must not be written when the channel is enabled. **/
#define BDMA1_CPAR6			MMIO32(BDMA1_BASE + 0x88)
/** BDMA1_CM0AR6 This register must not be written when the channel is enabled. **/
#define BDMA1_CM0AR6			MMIO32(BDMA1_BASE + 0x8c)
/** BDMA1_CM1AR6 This register must not be written when the channel is enabled. **/
#define BDMA1_CM1AR6			MMIO32(BDMA1_BASE + 0x90)
/** BDMA1_CCR7 DMA channel x configuration register **/
#define BDMA1_CCR7			MMIO32(BDMA1_BASE + 0x94)
/** BDMA1_CNDTR7 DMA channel x number of data register **/
#define BDMA1_CNDTR7			MMIO32(BDMA1_BASE + 0x98)
/** BDMA1_CPAR7 This register must not be written when the channel is enabled. **/
#define BDMA1_CPAR7			MMIO32(BDMA1_BASE + 0x9c)
/** BDMA1_CM0AR7 This register must not be written when the channel is enabled. **/
#define BDMA1_CM0AR7			MMIO32(BDMA1_BASE + 0xa0)
/** BDMA1_CM1AR7 This register must not be written when the channel is enabled. **/
#define BDMA1_CM1AR7			MMIO32(BDMA1_BASE + 0xa4)

/**@}*/


/** @defgroup bdma1_isr ISR DMA interrupt status register
@{*/

/** BDMA1_ISR_TEIF8 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_TEIF8		(1 << 31)
/** BDMA1_ISR_HTIF8 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_HTIF8		(1 << 30)
/** BDMA1_ISR_TCIF8 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_TCIF8		(1 << 29)
/** BDMA1_ISR_GIF8 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_GIF8		(1 << 28)
/** BDMA1_ISR_TEIF7 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_TEIF7		(1 << 27)
/** BDMA1_ISR_HTIF7 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_HTIF7		(1 << 26)
/** BDMA1_ISR_TCIF7 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_TCIF7		(1 << 25)
/** BDMA1_ISR_GIF7 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_GIF7		(1 << 24)
/** BDMA1_ISR_TEIF6 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_TEIF6		(1 << 23)
/** BDMA1_ISR_HTIF6 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_HTIF6		(1 << 22)
/** BDMA1_ISR_TCIF6 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_TCIF6		(1 << 21)
/** BDMA1_ISR_GIF6 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_GIF6		(1 << 20)
/** BDMA1_ISR_TEIF5 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_TEIF5		(1 << 19)
/** BDMA1_ISR_HTIF5 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_HTIF5		(1 << 18)
/** BDMA1_ISR_TCIF5 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_TCIF5		(1 << 17)
/** BDMA1_ISR_GIF5 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_GIF5		(1 << 16)
/** BDMA1_ISR_TEIF4 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_TEIF4		(1 << 15)
/** BDMA1_ISR_HTIF4 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_HTIF4		(1 << 14)
/** BDMA1_ISR_TCIF4 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_TCIF4		(1 << 13)
/** BDMA1_ISR_GIF4 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_GIF4		(1 << 12)
/** BDMA1_ISR_TEIF3 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_TEIF3		(1 << 11)
/** BDMA1_ISR_HTIF3 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_HTIF3		(1 << 10)
/** BDMA1_ISR_TCIF3 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_TCIF3		(1 << 9)
/** BDMA1_ISR_GIF3 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_GIF3		(1 << 8)
/** BDMA1_ISR_TEIF2 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_TEIF2		(1 << 7)
/** BDMA1_ISR_HTIF2 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_HTIF2		(1 << 6)
/** BDMA1_ISR_TCIF2 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_TCIF2		(1 << 5)
/** BDMA1_ISR_GIF2 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_GIF2		(1 << 4)
/** BDMA1_ISR_TEIF1 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_TEIF1		(1 << 3)
/** BDMA1_ISR_HTIF1 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_HTIF1		(1 << 2)
/** BDMA1_ISR_TCIF1 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_TCIF1		(1 << 1)
/** BDMA1_ISR_GIF1 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA1_ISR_GIF1		(1 << 0)

/**@}*/

