grevaillot/svd_tools/headers/STM32H7A3x/bdma1.h
/** @defgroup bdma1_cndtr7 CNDTR7 DMA channel x number of data register
@{*/


#define BDMA1_CNDTR7_NDT_SHIFT		0
#define BDMA1_CNDTR7_NDT_MASK		0xffff
/** @defgroup bdma1_cndtr7_ndt NDT Number of data to transfer Number of data to be transferred (0 up to 65535). This register can only be written when the channel is disabled. Once the channel is enabled, this register is read-only, indicating the remaining bytes to be transmitted. This register decrements after each DMA transfer. Once the transfer is completed, this register can either stay at zero or be reloaded automatically by the value previously programmed if the channel is configured in auto-reload mode. If this register is zero, no transaction can be served whether the channel is enabled or not.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma1_cpar7 CPAR7 This register must not be written when the channel is enabled.
@{*/


#define BDMA1_CPAR7_PA_SHIFT		0
#define BDMA1_CPAR7_PA_MASK		0xffffffff
/** @defgroup bdma1_cpar7_pa PA Peripheral address Base address of the peripheral data register from/to which the data will be read/written. When PSIZE is 01 (16-bit), the PA[0] bit is ignored. Access is automatically aligned to a half-word address. When PSIZE is 10 (32-bit), PA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma1_cm0ar7 CM0AR7 This register must not be written when the channel is enabled.
@{*/


#define BDMA1_CM0AR7_MA_SHIFT		0
#define BDMA1_CM0AR7_MA_MASK		0xffffffff
/** @defgroup bdma1_cm0ar7_ma MA Memory address Base address of the memory area from/to which the data will be read/written. When MSIZE is 01 (16-bit), the MA[0] bit is ignored. Access is automatically aligned to a half-word address. When MSIZE is 10 (32-bit), MA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma1_cm1ar7 CM1AR7 This register must not be written when the channel is enabled.
@{*/


/**@}*/
